# Chapter 6 - Data Loading, Storage, and File Formats

In [1]:
import pandas as pd

## 6.1 Reading and Writing Data in Text Format

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv("examples/ex1.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv("examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv("examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ["a", "b", "c", "d", "message"]

In [9]:
pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [11]:
parsed = pd.read_csv("examples/csv_mindex.csv", index_col=["key1", "key2"])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
!cat examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
# This isn't working for some reason
result = pd.read_csv("examples/ex3.txt", sep='\\s+')

result

In [15]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
pd.read_csv("examples/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [18]:
result = pd.read_csv("examples/ex5.csv")

In [19]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [20]:
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])

In [21]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [23]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [24]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [25]:
result3 = pd.read_csv("examples/ex5.csv", keep_default_na=False, na_values=["NA"])

In [26]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [27]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [28]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [29]:
pd.read_csv("examples/ex5.csv", na_values=sentinels,keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

### Reading Text Files in Pieces

In [30]:
pd.options.display.max_rows = 10

In [31]:
result = pd.read_csv("examples/ex6.csv")

In [32]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [33]:
pd.read_csv("examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [34]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [35]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [36]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [37]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing Data to Text Format

In [38]:
data = pd.read_csv("examples/ex5.csv")

In [39]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
data.to_csv("examples/out.csv")

In [41]:
import sys

In [42]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [43]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [45]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### Working with Other Delimited Formats

In [46]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [47]:
import csv

In [48]:
f = open("examples/ex7.csv")

In [49]:
reader = csv.reader(f)

In [50]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [51]:
f.close()

In [52]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [53]:
header, values = lines[0], lines[1:]

In [54]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [55]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### JSON Data

In [56]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [57]:
import json

In [58]:
result = json.loads(obj)

In [59]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [60]:
asjson = json.dumps(result)

In [61]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [62]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [63]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [64]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [65]:
data = pd.read_json("examples/example.json")

In [66]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [67]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [68]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

In [69]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [70]:
len(tables)

1

In [71]:
failures = tables[0]

In [72]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [73]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [74]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

### Parsing XML with lxml.objectify

In [75]:
from lxml import objectify

In [76]:
# will not work as we don't have the data set
path = "datasets/mta_perd/Performance_MNR.xml"

In [77]:
# will not work as we don't have the data set
with open(path) as f:
    parsed = objectify .parse(f)

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/mta_perd/Performance_MNR.xml'

In [ ]:
# will not work as we don't have the data set
root = parsed.getroot()

In [ ]:
# will not work as we don't have the data set
perf = pd.DataFrame(data)

In [ ]:
# will not work as we don't have the data set
perf.head()

In [ ]:
# will not work as we don't have the data set
perf2 = pd.read_xml(path)

In [ ]:
# will not work as we don't have the data set
perf2.head()

## 6.2 Binary Data Formats

In [ ]:
frame = pd.read_csv("examples/ex1.csv")

In [ ]:
frame

In [ ]:
frame.to_pickle("examples/frame_pickle")

In [ ]:
pd.read_pickle("examples/frame_pickle")

### Reading Microsoft Excel Files

In [ ]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [ ]:
xlsx.sheet_names

In [ ]:
xlsx.parse(sheet_name="Sheet1")

In [ ]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

In [ ]:
frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [ ]:
frame

In [ ]:
writer = pd.ExcelWriter("examples/ex2.xlsx")

In [ ]:
frame.to_excel(writer, "Sheet1")

In [ ]:
writer.close()

In [ ]:
frame.to_excel("examples/ex2.xlsx")

### Using HDF5 Format

In [ ]:
import numpy as np

In [ ]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [78]:
# Not able to get HDF% working at this time, will revisit
store = pd.HDFStore("examples/mydata.h5")

ImportError: Missing optional dependency 'pytables'.  Use pip or conda to install pytables.

## 6.3 Interacting with Web APIs

In [2]:
import requests

In [3]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [4]:
resp = requests.get(url)

In [5]:
resp.raise_for_status()

In [6]:
resp

In [7]:
data = resp.json()

In [8]:
data[0]["title"]

'BUG: Read CSV on python engine fails with callable skiprows and chunk size specified (#55677)'

In [9]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [10]:
issues

,number,title,labels,state
0,56238,BUG: Read CSV on python engine fails with call...,[],open
1,56237,DEPR: Default of observed=False in DataFrame.p...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
2,56236,DEPR: observed=False default for DataFrame.piv...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
3,56235,Table cell styling,[],open
4,56234,DOC: Fix typo in copy_on_write docs,[],open
5,56233,BUG: `to_numpy` raise `ValueError: cannot conv...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
6,56232,DOC: Update release instructions,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
7,56231,BUG: DataFrame([empty EA Series]) returns NAs ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,56230,CoW warning mode: enable chained assignment wa...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
9,56229,TST/CLN: Remove makeFloat/Period/Int/NumericIndex,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
10,56228,BUG: DataFrame.update not operating in-place f...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
11,56227,BUG: DataFrame.update not operating in-place f...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,56226,BUG: `DataFrame.groupby with axis=1 is depreca...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
13,56223,"BUG: `.loc[:, 'a'] = ` is inplace when assigni...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,56221,BUG: `pd.nlargest` with `keep='all'` does not ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
15,56220,Switch arrow type for string array to large st...,[],open
16,56219,DOC: DataFrame.update doctests,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
17,56218,BUG: `DataFrame.astype` does not suppress exce...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,56215,CoW: Avoid warning for ArrowDtypes when settin...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
19,56214,CoW: Add warning for slicing a Series with a M...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
20,56213,BUG: inconsistency in freq of DatetimeIndex wh...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,56212,CoW: Avoid warning in apply for mixed dtype frame,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
22,56211,CoW: Avoid warning if temporary object is a copy,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
23,56209,Update indexing unpacking logic for single blo...,[],open
24,56207,WEB: Better management of releases,"[{'id': 1508144531, 'node_id': 'MDU6TGFiZWwxNT...",open
25,56204,BUG: Creating a string column on a mask result...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,56203,BUG: expanding dataframe row-wise with single-...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,56197,Adjust tests in json folder for new string option,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
28,56192,Adjust tests in parsers folder for new string ...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
29,56191,Adjust tests in extension folder for new strin...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open

## 6.4 Interacting with Databases

In [13]:
import sqlite3

In [27]:
query = '''
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
    c REAL,        d INTEGER)
    ;'''

In [28]:
con = sqlite3.connect("mydata.sqlite")

In [29]:
con.execute(query)

In [30]:
con.commit()

In [33]:
data = [("Atlanta", "Georgia", 1.25, 6),
("Tallahassee", "Florida", 2.6, 3),
("Sacramento", "California", 1.7, 5)]

In [35]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [36]:
con.executemany(stmt, data)

In [37]:
con.commit()

In [38]:
cursor = con.execute("SELECT * FROM test")

In [39]:
rows = cursor.fetchall()

In [40]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [41]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [42]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [46]:
import sqlalchemy as sqla

In [50]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [51]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5